In [45]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os

#EU JUNTEI DOIS DATASET EM 1 SÓ POR ISSO QUE TEM 5000 CREDIT SCORES ZERADOS

In [46]:
df = pd.read_csv('data.csv', sep=',')
df.head()

/var/folders/p4/jnb87qbx4_d13sj5n8tn96vw0000gn/T/ipykernel_92207/1671121642.py:1: DtypeWarning: Columns (27) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('data.csv', sep=',')

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
0,0x1602,CUS_0xd40,January,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,_,809.98,26.822620,22 Years and 1 Months,No,49.574949,80.41529543900253,High_spent_Small_value_payments,312.49408867943663,Good
1,0x1603,CUS_0xd40,February,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,31.944960,NaN,No,49.574949,118.28022162236736,Low_spent_Large_value_payments,284.62916249607184,Good
2,0x1604,CUS_0xd40,March,Aaron Maashoh,-500,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,28.609352,22 Years and 3 Months,No,49.574949,81.699521264648,Low_spent_Medium_value_payments,331.2098628537912,Good
3,0x1605,CUS_0xd40,April,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,31.377862,22 Years and 4 Months,No,49.574949,199.4580743910713,Low_spent_Small_value_payments,223.45130972736786,Good
4,0x1606,CUS_0xd40,May,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,Good,809.98,24.797347,22 Years and 5 Months,No,49.574949,41.420153086217326,High_spent_Medium_value_payments,341.48923103222177,Good

In [47]:
df.shape

(150000, 28)

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150000 entries, 0 to 149999
Data columns (total 28 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   ID                        150000 non-null  object
 1   Customer_ID               150000 non-null  object
 2   Month                     150000 non-null  object
 3   Name                      135000 non-null  object
 4   Age                       150000 non-null  object
 5   SSN                       150000 non-null  object
 6   Occupation                150000 non-null  object
 7   Annual_Income             150000 non-null  object
 8   Monthly_Inhand_Salary     127500 non-null  float64
 9   Num_Bank_Accounts         150000 non-null  int64
 10  Num_Credit_Card           150000 non-null  int64
 11  Interest_Rate             150000 non-null  int64
 12  Num_of_Loan               150000 non-null  object
 13  Type_of_Loan              132888 non-null  object
 14  Delay_from_due_date       150000 non-null  int64
 15  Num_of_Delayed_Payment    139500 non-null  object
 16  Changed_Credit_Limit      150000 non-null  object
 17  Num_Credit_Inquiries      147000 non-null  float64
 18  Credit_Mix                150000 non-null  object
 19  Outstanding_Debt          150000 non-null  object
 20  Credit_Utilization_Ratio  150000 non-null  float64
 21  Credit_History_Age        136500 non-null  object
 22  Payment_of_Min_Amount     150000 non-null  object
 23  Total_EMI_per_month       150000 non-null  float64
 24  Amount_invested_monthly   143250 non-null  object
 25  Payment_Behaviour         150000 non-null  object
 26  Monthly_Balance           148238 non-null  object
 27  Credit_Score              100000 non-null  object
dtypes: float64(4), int64(4), object(20)
memory usage: 32.0+ MB

In [49]:
df.columns

Index(['ID', 'Customer_ID', 'Month', 'Name', 'Age', 'SSN', 'Occupation',
       'Annual_Income', 'Monthly_Inhand_Salary', 'Num_Bank_Accounts',
       'Num_Credit_Card', 'Interest_Rate', 'Num_of_Loan', 'Type_of_Loan',
       'Delay_from_due_date', 'Num_of_Delayed_Payment', 'Changed_Credit_Limit',
       'Num_Credit_Inquiries', 'Credit_Mix', 'Outstanding_Debt',
       'Credit_Utilization_Ratio', 'Credit_History_Age',
       'Payment_of_Min_Amount', 'Total_EMI_per_month',
       'Amount_invested_monthly', 'Payment_Behaviour', 'Monthly_Balance',
       'Credit_Score'],
      dtype='object')

In [50]:
df.describe()

,Monthly_Inhand_Salary,Num_Bank_Accounts,Num_Credit_Card,Interest_Rate,Delay_from_due_date,Num_Credit_Inquiries,Credit_Utilization_Ratio,Total_EMI_per_month
count,127500.000000,150000.000000,150000.000000,150000.000000,150000.000000,147000.000000,150000.000000,150000.000000
mean,4190.115139,17.006940,22.623447,71.234907,21.063400,28.529014,32.283309,1432.513579
std,3180.489657,117.069476,129.143006,461.537193,14.860154,194.456058,5.113315,8403.759977
min,303.645417,-1.000000,0.000000,1.000000,-5.000000,0.000000,20.000000,0.000000
25%,1625.265833,3.000000,4.000000,8.000000,10.000000,3.000000,28.054731,30.947775
50%,3091.000000,6.000000,5.000000,13.000000,18.000000,6.000000,32.297058,71.280006
75%,5948.454596,7.000000,7.000000,20.000000,28.000000,9.000000,36.487954,166.279555
max,15204.633333,1798.000000,1499.000000,5799.000000,67.000000,2597.000000,50.000000,82398.000000

In [51]:
df.isna().sum()

ID                              0
Customer_ID                     0
Month                           0
Name                        15000
Age                             0
SSN                             0
Occupation                      0
Annual_Income                   0
Monthly_Inhand_Salary       22500
Num_Bank_Accounts               0
Num_Credit_Card                 0
Interest_Rate                   0
Num_of_Loan                     0
Type_of_Loan                17112
Delay_from_due_date             0
Num_of_Delayed_Payment      10500
Changed_Credit_Limit            0
Num_Credit_Inquiries         3000
Credit_Mix                      0
Outstanding_Debt                0
Credit_Utilization_Ratio        0
Credit_History_Age          13500
Payment_of_Min_Amount           0
Total_EMI_per_month             0
Amount_invested_monthly      6750
Payment_Behaviour               0
Monthly_Balance              1762
Credit_Score                50000
dtype: int64

In [52]:
df.duplicated().sum()

np.int64(0)

#TODO: Explicar o que é cada coluna

In [53]:
na_counts = df.isna().sum()
cols_with_na = na_counts[na_counts > 0]
print(cols_with_na)
print(list(cols_with_na.index))

Name                       15000
Monthly_Inhand_Salary      22500
Type_of_Loan               17112
Num_of_Delayed_Payment     10500
Num_Credit_Inquiries        3000
Credit_History_Age         13500
Amount_invested_monthly     6750
Monthly_Balance             1762
Credit_Score               50000
dtype: int64
['Name', 'Monthly_Inhand_Salary', 'Type_of_Loan', 'Num_of_Delayed_Payment', 'Num_Credit_Inquiries', 'Credit_History_Age', 'Amount_invested_monthly', 'Monthly_Balance', 'Credit_Score']

In [54]:
columns_to_drop = ['Name', 'SSN']
df = df.drop(columns=columns_to_drop)

In [55]:
obj_cols = df.select_dtypes(include=['object']).columns
print(obj_cols)
print(len(obj_cols))

Index(['ID', 'Customer_ID', 'Month', 'Age', 'Occupation', 'Annual_Income',
       'Num_of_Loan', 'Type_of_Loan', 'Num_of_Delayed_Payment',
       'Changed_Credit_Limit', 'Credit_Mix', 'Outstanding_Debt',
       'Credit_History_Age', 'Payment_of_Min_Amount',
       'Amount_invested_monthly', 'Payment_Behaviour', 'Monthly_Balance',
       'Credit_Score'],
      dtype='object')
18

#TEM MUITA COLUNA AQUI QUE DEVERIA SER NUMÉRICA

In [57]:
cols_should_be_num = ['Age', 'Annual_Income', 'Num_of_Loan', 'Num_of_Delayed_Payment',
                      'Changed_Credit_Limit', 'Outstanding_Debt',
                      'Amount_invested_monthly', 'Monthly_Balance']

In [59]:
for col in cols_should_be_num:
    print('---', col, '---')
    s = df[col]
    # tentar converter (remover vírgulas e espaços antes)
    s_str = s.astype(str).str.strip().replace(',', '')
    converted = pd.to_numeric(s_str, errors='coerce')

    # 1) valores não conversíveis (origem não nula mas converte para NaN)
    bad_mask = s.notna() & converted.isna()
    print('non-convertible count:', bad_mask.sum())
    if bad_mask.sum():
        print('examples non-convertible values:', pd.Series(s[bad_mask].unique()).head(20).tolist())
        display(df.loc[bad_mask, ['ID', col]].head(10))

    # 2) zeros e negativos (caso sejam inválidos no seu contexto)
    zeros = (converted == 0)
    negs = (converted < 0)
    print('zeros count:', int(zeros.sum()), '(%0.2f%%)' % (100 * zeros.sum() / len(df)))
    print('negatives count:', int(negs.sum()))

    if zeros.sum():
        display(df.loc[zeros, ['ID', col]].head(5))
    if negs.sum():
        display(df.loc[negs, ['ID', col]].head(5))

    # 3) outliers via IQR
    vals = converted.dropna()
    if len(vals) >= 5:
        q1 = vals.quantile(0.25)
        q3 = vals.quantile(0.75)
        iqr = q3 - q1
        lo = q1 - 1.5 * iqr
        hi = q3 + 1.5 * iqr
        out_mask = (converted < lo) | (converted > hi)
        print('outliers (IQR) count:', int(out_mask.sum()))
        if out_mask.sum():
            display(df.loc[out_mask, ['ID', col,]].assign(_converted=converted[out_mask]).head(10))
    else:
        print('not enough numeric values for outlier detection')

    print()

--- Age ---
non-convertible count: 7416
examples non-convertible values: ['28_', '34_', '30_', '24_', '33_', '35_', '31_', '40_', '37_', '54_', '21_', '20_', '43_', '38_', '18_', '2111_', '46_', '16_', '19_', '47_']

         ID  Age
8    0x160e  28_
54   0x1650  34_
58   0x1658  30_
71   0x1669  24_
89   0x1687  33_
97   0x1693  35_
123  0x16b9  30_
184  0x1716  31_
227  0x1755  40_
236  0x1762  37_

zeros count: 0 (0.00%)
negatives count: 1350

         ID   Age
2    0x1604  -500
113  0x16ab  -500
289  0x17b3  -500
340  0x17fe  -500
560  0x194a  -500

outliers (IQR) count: 4057

         ID   Age  _converted
2    0x1604  -500      -500.0
56   0x1656  7580      7580.0
113  0x16ab  -500      -500.0
122  0x16b8   181       181.0
219  0x1749   995       995.0
243  0x176d  5079      5079.0
288  0x17b2  6409      6409.0
289  0x17b3  -500      -500.0
301  0x17c3  7080      7080.0
328  0x17ee   849       849.0

--- Annual_Income ---
non-convertible count: 10500
examples non-convertible values: ['34847.84_', '30689.89_', '35547.71_', '34081.38_', '114838.41_', '88640.24_', '54392.16_', '8701.545_', '25546.26_', '92047.08_', '97791.42_', '10183.015_', '106733.13_', '12600.445_', '57983.12_', '34290.12_', '43070.24_', '6515990.0_', '39641.54_', '29469.98_']

         ID Annual_Income
10   0x1610     34847.84_
27   0x1629     30689.89_
32   0x1632     35547.71_
56   0x1656     34081.38_
66   0x1664    114838.41_
94   0x168c     88640.24_
98   0x1694     54392.16_
106  0x16a0     8701.545_
111  0x16a5     8701.545_
115  0x16ad     25546.26_

zeros count: 0 (0.00%)
negatives count: 0
outliers (IQR) count: 3884

         ID Annual_Income  _converted
54   0x1650    10909427.0  10909427.0
245  0x176f      586359.0    586359.0
361  0x181f    18334118.0  18334118.0
368  0x182a    19717385.0  19717385.0
379  0x1839     2709655.0   2709655.0
420  0x1876     2592822.0   2592822.0
564  0x194e    19257912.0  19257912.0
602  0x1988    22335783.0  22335783.0
617  0x199f    16367214.0  16367214.0
895  0x1b3d     9351702.0   9351702.0

--- Num_of_Loan ---
non-convertible count: 7221
examples non-convertible values: ['0_', '3_', '2_', '5_', '8_', '9_', '4_', '7_', '1_', '6_', '597_', '92_', '1347_', '1185_', '235_', '1459_', '1320_', '630_', '359_', '1225_']

         ID Num_of_Loan
37   0x1637          0_
80   0x167a          3_
84   0x167e          3_
94   0x168c          2_
119  0x16b1          5_
125  0x16bb          2_
131  0x16c5          0_
144  0x16da          0_
158  0x16ec          5_
256  0x1782          2_

zeros count: 15543 (10.36%)
negatives count: 5850

        ID Num_of_Loan
32  0x1632           0
33  0x1633           0
35  0x1635           0
36  0x1636           0
38  0x1638           0

        ID Num_of_Loan
31  0x162d        -100
34  0x1634        -100
39  0x1639        -100
53  0x164f        -100
61  0x165b        -100

outliers (IQR) count: 6547

         ID Num_of_Loan  _converted
21   0x161f         967       967.0
31   0x162d        -100      -100.0
34   0x1634        -100      -100.0
39   0x1639        -100      -100.0
53   0x164f        -100      -100.0
61   0x165b        -100      -100.0
64   0x1662        -100      -100.0
78   0x1674        -100      -100.0
126  0x16bc        -100      -100.0
180  0x170e        -100      -100.0

--- Num_of_Delayed_Payment ---
non-convertible count: 4171
examples non-convertible values: ['8_', '3_', '2_', '13_', '14_', '12_', '22_', '4_', '11_', '21_', '10_', '183_', '9_', '19_', '24_', '17_', '23_', '20_', '6_', '1_']

         ID Num_of_Delayed_Payment
6    0x1608                     8_
11   0x1611                     3_
53   0x164f                     3_
54   0x1650                     2_
119  0x16b1                    13_
124  0x16ba                    14_
141  0x16d3                    12_
176  0x170a                     8_
298  0x17c0                    22_
324  0x17e6                    14_

zeros count: 2352 (1.57%)
negatives count: 897

        ID Num_of_Delayed_Payment
13  0x1613                      0
72  0x166e                      0
73  0x166f                      0
74  0x1670                      0
75  0x1671                      0

          ID Num_of_Delayed_Payment
10    0x1610                     -1
698   0x1a18                     -1
1253  0x1d57                     -3
1561  0x1f27                     -2
2167  0x22b1                     -1

outliers (IQR) count: 1098

          ID Num_of_Delayed_Payment  _converted
252   0x177a                   3318      3318.0
284   0x17aa                   3083      3083.0
304   0x17ca                   1338      1338.0
409   0x1867                   3104      3104.0
706   0x1a24                   1106      1106.0
807   0x1ab9                    834       834.0
1032  0x1c0e                   2672      2672.0
1212  0x1d1a                   2008      2008.0
1303  0x1da1                    538       538.0
1611  0x1f71                   3478      3478.0

--- Changed_Credit_Limit ---
non-convertible count: 3150
examples non-convertible values: ['_']

         ID Changed_Credit_Limit
2    0x1604                    _
65   0x1663                    _
66   0x1664                    _
109  0x16a3                    _
110  0x16a4                    _
177  0x170b                    _
243  0x176d                    _
248  0x1776                    _
254  0x177c                    _
299  0x17c1                    _

zeros count: 6 (0.00%)
negatives count: 2421

             ID Changed_Credit_Limit
26707    0xb27d                  0.0
41779   0x10acd                  0.0
56685   0x16223                  0.0
94085   0x23d47                  0.0
125420  0x13fee                  0.0

         ID Changed_Credit_Limit
27   0x1629                -2.01
28   0x162a                -1.01
29   0x162b                -3.01
73   0x166f  -1.2400000000000002
179  0x170d                -4.14

outliers (IQR) count: 1052

         ID Changed_Credit_Limit  _converted
584  0x196e                29.52       29.52
585  0x196f                29.52       29.52
586  0x1970                31.52       31.52
587  0x1971                29.52       29.52
588  0x1972                29.52       29.52
589  0x1973                29.52       29.52
590  0x1974                29.52       29.52
591  0x1975                29.52       29.52
633  0x19b7                29.21       29.21
682  0x1a00                32.64       32.64

--- Outstanding_Debt ---
non-convertible count: 1500
examples non-convertible values: ['1328.93_', '1283.37_', '2797.17_', '3818.57_', '343.84_', '363.51_', '404.51_', '1755.81_', '2593.44_', '89.62_', '1054.86_', '1374.23_', '1166.47_', '457.81_', '1684.06_', '1126.35_', '2098.83_', '761.18_', '1343.01_', '1342.61_']

         ID Outstanding_Debt
87   0x1681         1328.93_
142  0x16d4         1283.37_
368  0x182a         2797.17_
632  0x19b6         3818.57_
703  0x1a1d          343.84_
731  0x1a49          363.51_
782  0x1a94          404.51_
819  0x1acd         1755.81_
835  0x1ae5         2593.44_
992  0x1bd2           89.62_

zeros count: 0 (0.00%)
negatives count: 0
outliers (IQR) count: 7831

         ID Outstanding_Debt  _converted
416  0x1872          4071.62     4071.62
417  0x1873          4071.62     4071.62
418  0x1874          4071.62     4071.62
419  0x1875          4071.62     4071.62
420  0x1876          4071.62     4071.62
421  0x1877          4071.62     4071.62
422  0x1878          4071.62     4071.62
423  0x1879          4071.62     4071.62
480  0x18d2          4834.59     4834.59
481  0x18d3          4834.59     4834.59

--- Amount_invested_monthly ---
non-convertible count: 6480
examples non-convertible values: ['__10000__']

         ID Amount_invested_monthly
18   0x161c               __10000__
23   0x1621               __10000__
28   0x162a               __10000__
121  0x16b7               __10000__
142  0x16d4               __10000__
161  0x16f3               __10000__
200  0x172e               __10000__
209  0x173b               __10000__
284  0x17aa               __10000__
346  0x1808               __10000__

zeros count: 275 (0.18%)
negatives count: 0

          ID Amount_invested_monthly
184   0x1716                     0.0
1004  0x1be2                     0.0
1698  0x1ff4                     0.0
1719  0x2011                     0.0
2766  0x2634                     0.0

outliers (IQR) count: 11355

         ID Amount_invested_monthly  _converted
19   0x161d       825.2162699393922  825.216270
43   0x1641       618.2023912505837  618.202391
49   0x164b       698.8732707169384  698.873271
54   0x1650       930.3918977796665  930.391898
55   0x1651         870.52238171816  870.522382
68   0x1666       649.8093641841638  649.809364
69   0x1667       546.3805705230692  546.380571
93   0x168b       686.1262165951837  686.126217
99   0x1695       494.8422277056662  494.842228
101  0x1697       635.1465605054178  635.146561

--- Monthly_Balance ---
non-convertible count: 15
examples non-convertible values: ['__-333333333333333333333333333__']

             ID                   Monthly_Balance
5545     0x367f  __-333333333333333333333333333__
26177    0xaf63  __-333333333333333333333333333__
29158    0xc0d8  __-333333333333333333333333333__
35570    0xe66c  __-333333333333333333333333333__
38622    0xf84c  __-333333333333333333333333333__
60009   0x1759f  __-333333333333333333333333333__
75251   0x1ceed  __-333333333333333333333333333__
82918   0x1fbd8  __-333333333333333333333333333__
83255   0x1fdd1  __-333333333333333333333333333__
111363   0x9b2d  __-333333333333333333333333333__

zeros count: 0 (0.00%)
negatives count: 0
outliers (IQR) count: 11460

        ID     Monthly_Balance   _converted
16  0x161a  1043.3159778669492  1043.315978
17  0x161b   998.8692967863226   998.869297
20  0x161e   810.7821526659284   810.782153
21  0x161f   963.9215811205684   963.921581
22  0x1620   968.5555173846187   968.555517
23  0x1621    895.494583180492   895.494583
47  0x1645   796.2349097481042   796.234910
48  0x164a    858.462474411158   858.462474
50  0x164c  1038.5694068321734  1038.569407
51  0x164d   899.1987716145285   899.198772

#LIMPAR TODOS ESSES VALORES ZOADOS

In [56]:
num_cols = df.select_dtypes(include=['int64', 'float64']).columns
print(num_cols)
print(len(num_cols))

Index(['Monthly_Inhand_Salary', 'Num_Bank_Accounts', 'Num_Credit_Card',
       'Interest_Rate', 'Delay_from_due_date', 'Num_Credit_Inquiries',
       'Credit_Utilization_Ratio', 'Total_EMI_per_month'],
      dtype='object')
8